Revit 2026 API

# RebarShapeRebarShapeMatchesCurvesAndTerminationsData Method

---
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static bool RebarShapeMatchesCurvesAndTerminationsData(
	RebarShape rebarShape,
	RebarBarType barType,
	XYZ norm,
	IList<Curve> curves,
	RebarShapeTerminationsData rebarShapeTerminationsData
)
```
```vb
Public Shared Function RebarShapeMatchesCurvesAndTerminationsData (
	rebarShape As RebarShape,
	barType As RebarBarType,
	norm As XYZ,
	curves As IList(Of Curve),
	rebarShapeTerminationsData As RebarShapeTerminationsData
) As Boolean
```
```cpp
public:
static bool RebarShapeMatchesCurvesAndTerminationsData(
	RebarShape^ rebarShape,
	RebarBarType^ barType,
	XYZ^ norm,
	IList<Curve^>^ curves,
	RebarShapeTerminationsData^ rebarShapeTerminationsData
)
```
```fsharp
static member RebarShapeMatchesCurvesAndTerminationsData :
        rebarShape : RebarShape *
        barType : RebarBarType *
        norm : XYZ *
        curves : IList<Curve> *
        rebarShapeTerminationsData : RebarShapeTerminationsData -> bool
```

#### Parameters

rebarShape RebarShape

barType RebarBarType

norm XYZ

curves IListCurve

rebarShapeTerminationsData RebarShapeTerminationsData

#### Return Value

Boolean

#### Reference

RebarShape Class

Autodesk.Revit.DB.Structure Namespace